using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace laba4
{
    class Znak
    {
        public static string Zodiak(int d, int m)
        {
            if ((d >= 21 && d <= 31 && m == 3) || (d>=1 && d <= 20 && m == 4)) return "Овен";
            if ((d >= 21 && d <= 30 && m == 4) || (d >= 1 && d <= 20 && m == 5)) return "Телец";
            if ((d >= 21 && d <= 31 && m == 5) || (d >= 1 && d <= 21 && m == 6)) return "Близнецы";
            if ((d >= 22 && d <= 30 && m == 6) || (d >= 1 && d <= 22 && m == 7)) return "Рак";
            if ((d >= 23 && d <= 31 && m == 7) || (d >= 1 && d <= 23 && m == 8)) return "Лев";
            if ((d >= 24 && d <= 31 && m == 8) || (d >= 1 && d <= 23 && m == 9)) return "Дева";
            if ((d >= 24 && d <= 30 && m == 9) || (d >= 1 && d <= 23 && m == 10)) return "Весы";
            if ((d >= 24 && d <= 31 && m == 10) || (d >= 1 && d <= 22 && m == 11)) return "Скорпион";
            if ((d >= 23 && d <= 30 && m == 11) || (d >= 1 && d <= 21 && m == 12)) return "Стрелец";
            if ((d >= 22 && d <= 31 && m == 12) || (d >= 1 && d <= 20 && m == 1)) return "Козерог";
            if ((d >= 21 && d <= 31 && m == 1) || (d >= 1 && d <= 18 && m == 2)) return "Водолей";
            if ((d >= 19 && d <= 29 && m == 2) || (d >= 1 && d <= 20 && m == 3)) return "Рыбы";
            else return "Проверьте правильность заполнения формы и повторите попытку";
        }
        public static string Zodiak(int d, string m)
        {
            if ((d >= 21 && d <= 31 && m == "Март") || (d >= 1 && d <= 20 && m == "Апрель")) return "Овен";
            if ((d >= 21 && d <= 30 && m == "Апрель") || (d >= 1 && d <= 20 && m == "Май")) return "Телец";
            if ((d >= 21 && d <= 31 && m == "Май") || (d >= 1 && d <= 21 && m == "Июнь")) return "Близнецы";
            if ((d >= 22 && d <= 30 && m == "Июнь") || (d >= 1 && d <= 22 && m == "Июль")) return "Рак";
            if ((d >= 23 && d <= 31 && m == "Июль") || (d >= 1 && d <= 23 && m == "Август")) return "Лев";
            if ((d >= 24 && d <= 31 && m == "Август") || (d >= 1 && d <= 23 && m == "Сентябрь")) return "Дева";
            if ((d >= 24 && d <= 30 && m == "Сентябрь") || (d >= 1 && d <= 23 && m == "Октябрь")) return "Весы";
            if ((d >= 24 && d <= 31 && m == "Октябрь") || (d >= 1 && d <= 22 && m == "Ноябрь")) return "Скорпион";
            if ((d >= 23 && d <= 30 && m == "Ноябрь") || (d >= 1 && d <= 21 && m == "Декабрь")) return "Стрелец";
            if ((d >= 22 && d <= 31 && m == "Декабрь") || (d >= 1 && d <= 20 && m == "Январь")) return "Козерог";
            if ((d >= 21 && d <= 31 && m == "Январь") || (d >= 1 && d <= 18 && m == "Февраль")) return "Водолей";
            if ((d >= 19 && d <= 29 && m == "Февраль") || (d >= 1 && d <= 20 && m == "Март")) return "Рыбы";
            else return "Проверьте правильность заполнения формы и повторите попытку";
        }
        public static string Zodiak(string d)
        {
            if (d == "Овен") return "21 Марта - 20 Апреля";
            if (d == "Телец") return "21 Апреля - 20 Мая";
            if (d == "Близнецы") return "21 Мая - 21 Июня";
            if (d == "Рак") return "22 Июня - 22 Июля";
            if (d == "Лев") return "23 Июля - 23 Августа";
            if (d == "Дева") return "24 Августа - 23 Сентября";
            if (d == "Весы") return "24 Сентября - 23 Октября";
            if (d == "Скорпион") return "24 Октября - 22 Ноября";
            if (d == "Стрелец") return "23 Ноября - 21 Декабря";
            if (d == "Козерог") return "22 Декабря - 20 Января";
            if (d == "Водолей") return "21 Января - 18 Февраля";
            if (d == "Рыбы") return "19 Февраля - 20 Марта";
            else return "Проверьте правильность заполнения формы и повторите попытку";
        }
    }
}
